
/*------------------*/
/* インクルード		*/
/*------------------*/
#include "PuyoBlock.h"

/*------------------*/
/* メンバ関数		*/
/*------------------*/

/*----------------------------------------------------------*/
/*															*/
/*	[関数]	CPuyoBlock	:	引数なしコンストラクタ		*/
/*															*/
/*----------------------------------------------------------*/
CPuyoBlock::CPuyoBlock()
{
	m_Color			= BlockNS::BLACK;
	m_BlockState	= BlockNS::EMPTY;
	m_Check			= BlockNS::NON_CHECEKED_BLOCK;
	m_ConnectState	= BlockNS::BLOCK_CONNECT_NONE;
}

/*----------------------------------------------------------*/
/*															*/
/*	[関数]	CPuyoBlock()	:	引数ありコンストラクタ		*/
/*	---------------------------------------------------		*/
/*	[戻り値]	void		:	なし						*/
/*	[引数]		int			:	石のX座標					*/
/*				int			:	石のY座標					*/
/*				Stone_Color	:	石の状態					*/
/*															*/
/*----------------------------------------------------------*/
CPuyoBlock::CPuyoBlock( short color, unsigned short state)
{
	m_Color			= color;
	m_BlockState	= state;
	m_Check			= BlockNS::NON_CHECEKED_BLOCK;
	m_ConnectState	= BlockNS::BLOCK_CONNECT_NONE;
}

/*----------------------------------------------------------*/
/*															*/
/*	[関数]	PuyoBlock	:	引数なしコンストラクタ		*/
/*															*/
/*----------------------------------------------------------*/
CPuyoBlock::~CPuyoBlock()
{
}

/*------------------------------------------------------------------*/
/*																	*/
/*	[関数]		GeBlocktColor			:	ブロックカラーを取得	*/
/*	-------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&&	:	ブロックカラーの状態	*/
/*	[引数]									なし					*/
/*																	*/
/*------------------------------------------------------------------*/
unsigned short CPuyoBlock::GetBlockColor() const
{
	return m_Color;
}

/*------------------------------------------------------------------*/
/*																	*/
/*	[関数]		SetBlockColor			:	ブロックカラーを設定	*/
/*	-------------------------------------------------------------	*/
/*	[戻り値]	unsigned short&			:	ブロックカラー状態		*/
/*	[引数]									なし					*/
/*																	*/
/*------------------------------------------------------------------*/
unsigned short& CPuyoBlock::SetBlockColor()
{
	return m_Color;
}

/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		GetBlock				:	ブロックがあるかどうかを取得		*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックの状態						*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short CPuyoBlock::GetBlockState() const
{
	return m_BlockState;
}

/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		SetBlock				:	ブロックの状態を設定				*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックの状態						*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short& CPuyoBlock::SetBlockState()
{
	return m_BlockState;
}

/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		GetCheckBlock			:	ブロックがチェック済みどうかを取得	*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックのチェック状態				*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short CPuyoBlock::GetCheckBlock() const
{
	return m_Check;
}

/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		SetCheckBlock			:	ブロックをチェック済みに設定		*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックのチェック状態				*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short& CPuyoBlock::SetCheckBlock()
{
	return m_Check;
}


/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		GetConnectBlock			:	ブロックの連結状態を取得			*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックの連結状態					*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short CPuyoBlock::GetConnectBlock() const
{
	return m_ConnectState;
}

/*------------------------------------------------------------------------------*/
/*																				*/
/*	[関数]		SetConnectBlock			:	ブロックの連結状態を設定			*/
/*	---------------------------------------------------------------------------	*/
/*	[戻り値]	const unsigned short&	:	ブロックの連結状態					*/
/*	[引数]									なし								*/
/*																				*/
/*------------------------------------------------------------------------------*/
unsigned short& CPuyoBlock::SetConnectBlock()
{
	return m_ConnectState;
}
